//
// Created by DongHoony on 2019-11-20.
//

#include "land.h"
#include <stdio.h>

void show_land_info(Land l){

}
void show_gameboard(Land* gameboard){

}

void show_gameboard_grid(){
    printf("忙式式式式式式式式式式式式式式式式成式式式式式式式式式式式式式式式式成式式式式式式式式式式式式式式式式成式式式式式式式式式式式式式式式式成式式式式式式式式式式式式式式式式成式式式式式式式式式式式式式式式式成式式式式式式式式式式式式式式式式成式式式式式式式式式式式式式式式式忖\n");
    printf("弛                弛                弛                弛                弛                弛                弛                弛                弛\n");
    printf("弛                弛                弛                弛                弛                弛                弛                弛                弛\n");
    printf("弛                弛                弛                弛                弛                弛                弛                弛                弛\n");
    printf("弛                弛                弛                弛                弛                弛                弛                弛                弛\n");
    printf("弛                戍式式式式式式式式式式式式式式式式托式式式式式式式式式式式式式式式式托式式式式式式式式式式式式式式式式托式式式式式式式式式式式式式式式式托式式式式式式式式式式式式式式式式托式式式式式式式式式式式式式式式式扣                弛\n");
    printf("弛                弛                弛                弛                弛                弛                弛                弛                弛\n");
    printf("戍式式式式式式式式式式成式式式式式托式式式式式式式式式式式式式式式式扛式式式式式式式式式式式式式式式式扛式式式式式式式式式式式式式式式式扛式式式式式式式式式式式式式式式式扛式式式式式式式式式式式式式式式式扛式式式式式式式式式式式式式式式式托式式式式式成式式式式式式式式式式扣\n");
    printf("弛          弛     弛                                                                                                     弛     弛          弛\n");
    printf("弛          弛     弛                                                                                                     弛     弛          弛\n");
    printf("弛          弛     弛                                                                                                     弛     弛          弛\n");
    printf("弛          弛     弛                                                                                                     弛     弛          弛\n");
    printf("弛          弛     弛                                                                                                     弛     弛          弛\n");
    printf("戍式式式式式式式式式式托式式式式式扣                                                                                                     戍式式式式式托式式式式式式式式式式扣\n");
    printf("弛          弛     弛                                                                                                     弛     弛          弛\n");
    printf("弛          弛     弛                                                                                                     弛     弛          弛\n");
    printf("弛          弛     弛                                                                                                     弛     弛          弛\n");
    printf("弛          弛     弛                                                                                                     弛     弛          弛\n");
    printf("弛          弛     弛                                                                                                     弛     弛          弛\n");
    printf("戍式式式式式式式式式式托式式式式式扣                                                                                                     戍式式式式式托式式式式式式式式式式扣\n");
    printf("弛          弛     弛                                                                                                     弛     弛          弛\n");
    printf("弛          弛     弛                                                                                                     弛     弛          弛\n");
    printf("弛          弛     弛                                                                                                     弛     弛          弛\n");
    printf("弛          弛     弛                                                                                                     弛     弛          弛\n");
    printf("弛          弛     弛                                                                                                     弛     弛          弛\n");
    printf("戍式式式式式式式式式式扛式式式式式托式式式式式式式式式式式式式式式式成式式式式式式式式式式式式式式式式成式式式式式式式式式式式式式式式式成式式式式式式式式式式式式式式式式成式式式式式式式式式式式式式式式式成式式式式式式式式式式式式式式式式托式式式式式扛式式式式式式式式式式扣\n");
    printf("弛                弛                弛                弛                弛                弛                弛                弛                弛\n");
    printf("弛                戍式式式式式式式式式式式式式式式式托式式式式式式式式式式式式式式式式托式式式式式式式式式式式式式式式式托式式式式式式式式式式式式式式式式托式式式式式式式式式式式式式式式式托式式式式式式式式式式式式式式式式扣                弛\n");
    printf("弛                弛                弛                弛                弛                弛                弛                弛                弛\n");
    printf("戍                弛                弛                弛                弛                弛                弛                弛                弛\n");
    printf("弛                弛                弛                弛                弛                弛                弛                弛                弛\n");
    printf("弛                弛                弛                弛                弛                弛                弛                弛                弛\n");
    printf("戌式式式式式式式式式式式式式式式式扛式式式式式式式式式式式式式式式式扛式式式式式式式式式式式式式式式式扛式式式式式式式式式式式式式式式式扛式式式式式式式式式式式式式式式式扛式式式式式式式式式式式式式式式式扛式式式式式式式式式式式式式式式式扛式式式式式式式式式式式式式式式式戎\n");
};
